-- 插入初始数据
/*
  `medicine_id` BIGINT NOT NULL AUTO_INCREMENT COMMENT '药品库存id',
  `medicine_name` VARCHAR(120) NOT NULL COMMENT '药品名称',
  `medicine_number` INT NOT NULL COMMENT '库存数量',
  `production_date` TIMESTAMP NOT NULL DEFAULT current_timestamp COMMENT '生产日期（单位；日）',
  `expiration_date` TIMESTAMP NOT NULL COMMENT '保质期',
  `price` INT NOT NULL COMMENT '售价',
  `medicine_permitment` VARCHAR (250) COMMENT '国药准字编码',
  `description` TEXT NOT NULL COMMENT '详情描述：服用方法以及功效',
  `picture` MEDIUMBLOB  NOT NULL COMMENT '经过序列化后的图片',
  `warning_number` INT NOT NULL DEFAULT 20 COMMENT '预警数量线',
*/
INSERT INTO
  medicine(medicine_name, medicine_number, production_date, expiration_date, price, medicine_permitment, description,  warning_number)
VALUES
  ('三九/999 感冒灵颗粒','100','2017-12-12 00:00:00','2018-12-12 00:00:00','10','国药准字Z44021940','注意事项 :1.忌烟、酒及辛辣、生冷、油腻食物。2.不宜在服药期间同时服用滋补性中成药。3.本品含对乙酰氨基酚、马来酸氯苯那敏、咖啡因。服用本品期间不得饮酒或含有酒精的饮料；不能同时服用与本品成份相似的其他抗感冒药；肝、肾功能不全者慎用；膀胱颈梗阻、甲状腺功能亢进、青光眼、高血压和前列腺肥大者慎用；孕妇及哺乳期妇女慎用；服药期间不得驾驶机、车、船、从事高空作业、机械作业及操作精密仪器。4.脾胃虚寒，症见腹痛、喜暖、泄泻者慎用。5.心脏病、糖尿病等慢性病严重者应在医师指导下服用。6.儿童、年老体弱者应在医师指导下服用。','10'),
  ('	苯扎氯铵贴','100','2017-12-12 00:00:00','2018-12-12 00:00:00','10','国药准字H10920011','注意事项 : 1、本品为无菌产品，拆封后忌用手接触中间复合垫 ；2、使用前发现包装打开或破损请勿使用 ；3、用药部位如有烧灼感、瘙痒、红肿等情况应停药，并将局部药物洗净，必要时向医师咨询 ；4、对本品过敏者禁用，过敏体质者慎用 ；5、当本品性状发生改变时禁用 ；6、请将本品放在儿童不能接触的地方 ；7、儿童必须在成人监护下使用 ；8、如正在使用其他药品，使用本品前请咨询医师或药师 ；	','10'),
  ('吗丁啉','100','2017-12-12 00:00:00','2018-12-12 00:00:00','10','	国药准字H10910003','注意事项 : 1.孕妇慎用，哺乳期妇女使用本品期间应停止哺乳。2.建议儿童使用多潘立酮混悬液。3.心脏病患者（心律失常）以及接受化疗的肿瘤患者应用时需慎重，有可能加重心律紊乱。4.如服用过量或出现严重不良反应，应立即就医。5.对本品过敏者禁用，过敏体质者慎用。 	','10'),
  ('酮康唑乳膏','100','2017-12-12 00:00:00','2018-12-12 00:00:00','10','	国药准字H20043171','用法用量 : 局部外用，取本品适量涂于患处，每日1-2次。用药后虽可很快见效，但为减少复发，体癣、股癣、花斑癣及皮肤念珠菌病，应连续使用2~4周，手足癣应连续使用4~6周。	','10'),
  ('氯雷他定片','100','2017-12-12 00:00:00','2018-12-12 00:00:00','10','国药准字H10970410','不良反应 :主要包括头痛，嗜睡，疲乏，口干视觉模糊，血压降低或升高，心悸，晕厥，运动机能亢进，肝功能改变，黄疸，肝炎，肝坏死，脱发，癫痫发作，乳房肿大，多形性红斑及全身性过敏反应。	','10'),
  ('风油精','100','2017-12-12 00:00:00','2018-12-12 00:00:00','10','国药准字Z31020377','注意事项 :1、孕妇和三岁以下儿童慎用；2、皮肤有烫伤、损伤及溃疡者禁用；3、涂药时注意不要将药误入眼内；4、外涂后皮肤出现皮疹瘙痒者应停用；5、瓶盖宜拧紧，以防止药物挥发；	','10'),
  ('虎标红万金油','100','2017-12-12 00:00:00','2018-12-12 00:00:00','10','	进口药品注册标准JZ20010020','注意事项 :1.本品为外用药，禁止内服。2.忌食辛辣刺激性食物。3.切勿接触眼睛、口腔等黏膜处。皮肤破溃处禁用。4.儿童、孕妇、哺乳期妇女及年老体弱者应在医师指导下使用。5.因糖尿病、肾病、肝病、肿瘤等疾病引起的皮肤瘙痒，不属本品适应范围。	','10')